
import "../styles/legal.css";


export default function Privacy() {
  return (
    <div className="legal-page">
      <h1>מדיניות פרטיות</h1>

      <p>
        מדיניות פרטיות זו מפרטת כיצד אנו אוספים, משתמשים ושומרים על המידע
        הנמסר לנו דרך האתר.
      </p>

      <h2>איזה מידע אנו אוספים?</h2>
      <p>
        • מידע שנמסר בטופס צור קשר – שם, טלפון, הודעה. <br/>
        • נתוני שימוש בסיסיים הנאספים באופן אוטומטי, כגון כתובת IP ודפדפן.
      </p>

      <h2>כיצד אנו משתמשים במידע?</h2>
      <p>
        המידע משמש לצורך יצירת קשר עם הלקוחות, שיפור השירות והאתר וניתוח
        בסיסי של תנועה באתר.
      </p>

      <h2>שמירת מידע</h2>
      <p>
        המידע שמתקבל בטופס נשמר ב-Firebase Firestore בצורה מאובטחת.
        המידע לא יימכר ולא יועבר לצד ג׳.
      </p>

      <h2>מחיקת מידע</h2>
      <p>
        ניתן לפנות אלינו בכל עת לבקשת מחיקת מידע אישי, ואנו נענה לכך.
      </p>

      <h2>עוגיות (Cookies)</h2>
      <p>
        האתר עשוי להשתמש בקבצי Cookies למטרות טכניות ושיפור חוויית המשתמש.
      </p>

      <h2>עדכונים למדיניות</h2>
      <p>
        מדיניות פרטיות זו עשויה להתעדכן מעת לעת. השימוש באתר מהווה הסכמה
        למדיניות העדכנית.
      </p>
    </div>
  );
}
